#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.community will be created
  + resource "github_repository" "community" {
      + allow_merge_commit = true
      + allow_rebase_merge = true
      + allow_squash_merge = true
      + archived           = false
      + default_branch     = (known after apply)
      + description        = "TiKV community content"
      + etag               = (known after apply)
      + full_name          = (known after apply)
      + git_clone_url      = (known after apply)
      + has_issues         = true
      + html_url           = (known after apply)
      + http_clone_url     = (known after apply)
      + id                 = (known after apply)
      + name               = "community"
      + ssh_clone_url      = (known after apply)
      + svn_url            = (known after apply)
    }

  # github_repository.organization will be updated in-place
  ~ resource "github_repository" "organization" {
        allow_merge_commit = true
        allow_rebase_merge = true
        allow_squash_merge = true
        archived           = false
        auto_init          = false
        default_branch     = "master"
        description        = "Our organization"
        etag               = "W/\"f9fb5544cd34872c1114e2c4e80cc2d3\""
        full_name          = "hoverbear-tests-terraform-stuff/organization"
        git_clone_url      = "git://github.com/hoverbear-tests-terraform-stuff/organization.git"
        has_downloads      = false
      ~ has_issues         = false -> true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/hoverbear-tests-terraform-stuff/organization"
        http_clone_url     = "https://github.com/hoverbear-tests-terraform-stuff/organization.git"
        id                 = "organization"
        name               = "organization"
        private            = false
        ssh_clone_url      = "git@github.com:hoverbear-tests-terraform-stuff/organization.git"
        svn_url            = "https://github.com/hoverbear-tests-terraform-stuff/organization"
        topics             = []
    }

  # github_repository.raft-rs will be created
  + resource "github_repository" "raft-rs" {
      + allow_merge_commit = true
      + allow_rebase_merge = true
      + allow_squash_merge = true
      + archived           = false
      + default_branch     = (known after apply)
      + description        = "Raft distributed consensus algorithm implemented in Rust."
      + etag               = (known after apply)
      + full_name          = (known after apply)
      + git_clone_url      = (known after apply)
      + has_issues         = true
      + html_url           = (known after apply)
      + http_clone_url     = (known after apply)
      + id                 = (known after apply)
      + name               = "raft-rs"
      + ssh_clone_url      = (known after apply)
      + svn_url            = (known after apply)
    }

  # github_repository.rust-prometheus will be created
  + resource "github_repository" "rust-prometheus" {
      + allow_merge_commit = true
      + allow_rebase_merge = true
      + allow_squash_merge = true
      + archived           = false
      + default_branch     = (known after apply)
      + description        = "Prometheus instrumentation library for Rust applications"
      + etag               = (known after apply)
      + full_name          = (known after apply)
      + git_clone_url      = (known after apply)
      + has_issues         = true
      + html_url           = (known after apply)
      + http_clone_url     = (known after apply)
      + id                 = (known after apply)
      + name               = "rust-prometheus"
      + ssh_clone_url      = (known after apply)
      + svn_url            = (known after apply)
    }

  # github_repository.tikv will be created
  + resource "github_repository" "tikv" {
      + allow_merge_commit = true
      + allow_rebase_merge = true
      + allow_squash_merge = true
      + archived           = false
      + default_branch     = (known after apply)
      + description        = "Distributed transactional key-value database, originally created to complement TiDB"
      + etag               = (known after apply)
      + full_name          = (known after apply)
      + git_clone_url      = (known after apply)
      + has_issues         = true
      + homepage_url       = "https://tikv.org"
      + html_url           = (known after apply)
      + http_clone_url     = (known after apply)
      + id                 = (known after apply)
      + name               = "tikv"
      + ssh_clone_url      = (known after apply)
      + svn_url            = (known after apply)
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```

</details>

*Workflow: `PR Triggers`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
